Reports/ФинансовыеПотоки_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ФинансовыеПотоки_ат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьПлановуюВыручку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьЗатараты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьВыручку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьДоход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьТекущуюПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрытьПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ФинансовыеПотоки_ат/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//Отчеты_ат.ПриКомпоновкеРезультата(ЭтотОбъект);
	
	Если ТипЗнч(КомпоновщикНастроек.Настройки.Структура[0]) <> Тип("ТаблицаКомпоновкиДанных") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Колонка Из КомпоновщикНастроек.Настройки.Структура[0].Колонки Цикл
		
		Если Колонка.Имя = "ПланируемаяВыручка" Тогда
			
			Колонка.Использование = НЕ СкрытьПлановуюВыручку;
			
		ИначеЕсли Колонка.Имя = "Затраты" Тогда
			
			Колонка.Использование = НЕ СкрытьЗатараты;
			
		ИначеЕсли Колонка.Имя = "Выручка" Тогда
			
			Колонка.Использование = НЕ СкрытьВыручку;
			
		ИначеЕсли Колонка.Имя = "Доход" Тогда
			
			Колонка.Использование = НЕ СкрытьДоход;
			
		ИначеЕсли Колонка.Имя = "ТекущаяПрибыль" Тогда
			
			Колонка.Использование = НЕ СкрытьТекущуюПрибыль;
			
		ИначеЕсли Колонка.Имя = "Прибыль" Тогда
			
			Колонка.Использование = НЕ СкрытьПрибыль;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
